Catalogs/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРабочихДнейВНеделе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницаРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГрафикиРаботы/Ext/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНач, ДатаКон) Экспорт
	НаименованиеГрафика = Наименование;
Сутки = 24*60*60;
КалендарнаяДата = НачалоДня(ДатаНач); //начало графика
КонецПериода = КонецДня(ДатаКон); //конец графика
//создание набора записей соответсвующего графика
Набор = СоздатьНаборЗаписей();
//в цикле создаем записи в регистре сведений ГрафикиРаботы
Пока КалендарнаяДата <= КонецПериода Цикл
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.Дата = КалендарнаяДата;
	НоваяЗапись.ГрафикРаботы = Ссылка;
	ЕРВ = ЕдиницаРабочегоВремени;
	КРД = КоличествоРабочихДнейВНеделе;
	КРЧ = КоличествоРабочихЧасов;
	//определить рабочее и нерабочее время
	Значение = РасчетыНаСервере.Выходныеипраздники(КалендарнаяДата, ЕРВ, КРД, КРЧ, НаименованиеГрафика);
	НоваяЗапись.Значение = Значение;
	КалендарнаяДата = КалендарнаяДата + Сутки;
	Набор.Записать();
КонецЦикла;
КонецПроцедуры

Функция СоздатьНаборЗаписей()
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить (Ссылка);
	Набор.Очистить();
	Возврат Набор;
КонецФункции

Функция ОчиститьНаборЗаписей()
	Набор = РегистрыСведений.ГрафикиРаботы.ОчиститьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить (Ссылка);
	Набор.Очистить();
	Возврат Набор;
КонецФункции
